const bot = require("./bot");

const back = {
  reply_markup: JSON.stringify({
    inline_keyboard: [[{ text: " 🔙 Назад ●", callback_data: "back_to_menu" }]],
  }),
};

bot.on("message", async (msg) => {
  const text = msg.text;
  const chatId = msg.chat.id;
  if (text === "/info") {
    return bot.sendMessage(
      chatId,
      "<strong><b>📖ПРАВИЛА БРОНЮВАННЯ</b></strong>\n" +
        "<b>Коли заселення, виселення?</b>\n" +
        "• Заїзд з 15.00, виїзд до 11.00\n\n" +
        "<b>Як я отримаю ключі?</b>\n" +
        "• Наш адміністратор зустріне Вас за адресою, та проведе до апартаментів.\n\n" +
        "<b>Як отримати підтвердження бронювання?</b>\n" +
        "• Наші менеджери зв’яжуться з Вами, як тільки отримають лист з Вашим бронюванням, або Вам потрібно самостійно зв’язатись з Нами.\n\n" +
        "<b>Чи потрібно вносити передоплату?</b>\n" +
        "• Так, вам потрібно внести передоплату за першу добу.\n\n" +
        "<b>Які правила скасування?</b>\n" +
        "• Гість може скасувати за 30 днів до заїзду безкоштовно. Після закінчення терміну безкоштовного скасування передоплата не повертається.\n\n" +
        "<b>Що таке страховий депозит?</b>\n" +
        "Страховий депозит- це сума, яка вноситься при поселенні готівкою адміністратору, та повертається при виселенні, якщо Ви не порушили правил перебування.\n\n" +
        "<b>Що включено у проживання?</b>\n" +
        "– Wi-fi\n" +
        "– холодильник\n" +
        "– прасувальні засоби\n" +
        "– індивідуальне опалення\n" +
        "– засоби гігієни\n" +
        "– постільна білизна\n" +
        "– рушники\n" +
        "– душ\n" +
        "– зона кухні\n" +
        "– гаряча вода\n" +
        "– телевізор\n" +
        "– цілодобова технічна підтримка\n" +
        "– всі податки і збори.\n\n" +
        "<b>Які ще послуги я можу отримати додатково?( За домовленістю) за додаткову плату</b>\n" +
        "– додаткове прибирання\n" +
        "– трансфер\n" +
        "– додаткова постіль та рушники.\n\n" +
        "<b>Методи оплати</b>\n" +
        "Оплата може здійснюватись\n" +
        "– кредитною картою( в офісі)\n" +
        "– готівкою\n" +
        "– переказом на карту\n" +  
        "– по- перерахунку\n" +
        "– міжнародними переказами.",
      { parse_mode: "HTML", ...back }
    );
  }
});
